99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
#include "esp32_mquickjs_types.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_FS

#include "esp32_mquickjs_fs.h"
#include "esp32_mquickjs_memory.h"

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_fs_events.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_fs_atomic_write.h"
#include "esp32_mquickjs_options.h"
#include "utils/esp32_mquickjs_fs_path.h"
#include "esp32_mquickjs_stream.h"
#include "mquickjs_priv.h"

#include <dirent.h>
#include <errno.h>
#include <fcntl.h>
#include <inttypes.h>
#include <math.h>
#include <stdatomic.h>
#include <stdio.h>
#include <string.h>
#include <sys/stat.h>
#include <unistd.h>

#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_littlefs.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

static const char *TAG = "esp32qjs";

#define ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS 4U
#define ESP32_MQUICKJS_PARTITION_LABEL_MAX 17U
#define ESP32_MQUICKJS_FS_CHANGE_QUEUE_LEN 8U
#define ESP32_MQUICKJS_FS_CHANGE_QUEUE_MAX_LEN 64U
#define ESP32_MQUICKJS_FS_ATOMIC_TEMP_ATTEMPTS 32U

typedef struct {
    bool active;
    bool read_only;
    char partition_label[ESP32_MQUICKJS_PARTITION_LABEL_MAX];
    char base_path[ESP32_MQUICKJS_FS_ROOT_MAX];
} esp32_mquickjs_littlefs_mount_t;

typedef struct {
    esp32_mquickjs_fs_change_kind_t kind;
    uint32_t sequence;
    int64_t timestamp_us;
    char path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    char to_path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
} esp32_mquickjs_fs_change_event_t;

typedef struct esp32_mquickjs_fs_change_source {
    struct esp32_mquickjs_fs_runtime *owner;
    esp32_mquickjs_event_queue_t *changes;
    uint32_t event_sequence;
    char path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    struct esp32_mquickjs_fs_change_source *next;
} esp32_mquickjs_fs_change_source_t;

typedef struct esp32_mquickjs_fs_runtime {
    SemaphoreHandle_t lock;
    esp32_mquickjs_fs_change_source_t *sources;
} esp32_mquickjs_fs_runtime_t;

static bool s_littlefs_mounted;
static char s_fs_namespace_resource;
static _Atomic uint32_t s_fs_atomic_temp_counter;
static esp32_mquickjs_littlefs_mount_t
    s_littlefs_mounts[ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS];

static esp32_mquickjs_fs_runtime_t *fs_runtime(
    esp32_mquickjs_runtime_t *runtime)
{
    return runtime != NULL ? runtime->fs_state : NULL;
}

static const char *fs_change_kind_name(esp32_mquickjs_fs_change_kind_t kind)
{
    switch (kind) {
    case ESP32_MQUICKJS_FS_CHANGE_WRITE:
        return "write";
    case ESP32_MQUICKJS_FS_CHANGE_REMOVE:
        return "remove";
    case ESP32_MQUICKJS_FS_CHANGE_RENAME:
        return "rename";
    case ESP32_MQUICKJS_FS_CHANGE_MKDIR:
        return "mkdir";
    default:
        return "change";
    }
}

static JSValue fs_change_to_js(JSContext *ctx,
                               const void *event_value,
                               void *opaque)
{
    const esp32_mquickjs_fs_change_event_t *event = event_value;
    JSGCRef result_ref;
    JSValue *result;

    (void)opaque;
    if (event == NULL) {
        return JS_NULL;
    }
    result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sequence", JS_NewUint32(ctx, event->sequence)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "timestampUs", JS_NewInt64(ctx, event->timestamp_us)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "type", JS_NewString(ctx, fs_change_kind_name(event->kind))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "path", JS_NewString(ctx, event->path)) ||
        (event->kind == ESP32_MQUICKJS_FS_CHANGE_RENAME &&
         !esp32_mquickjs_set_property_ref(
             ctx, result, "toPath", JS_NewString(ctx, event->to_path)))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static void fs_change_queue_closed(void *opaque)
{
    esp32_mquickjs_fs_change_source_t *source = opaque;
    esp32_mquickjs_fs_runtime_t *state;
    esp32_mquickjs_fs_change_source_t **cursor;

    if (source == NULL || (state = source->owner) == NULL || state->lock == NULL) {
        return;
    }
    xSemaphoreTake(state->lock, portMAX_DELAY);
    cursor = &state->sources;
    while (*cursor != NULL) {
        if (*cursor == source) {
            *cursor = source->next;
            break;
        }
        cursor = &(*cursor)->next;
    }
    xSemaphoreGive(state->lock);
    heap_caps_free(source);
}

void esp32_mquickjs_fs_notify_change(esp32_mquickjs_fs_change_kind_t kind,
                                     const char *path,
                                     const char *to_path)
{
    esp32_mquickjs_fs_runtime_t *state = fs_runtime(
        esp32_mquickjs_get_active_runtime());
    esp32_mquickjs_fs_change_source_t *source;
    esp32_mquickjs_fs_change_event_t event;
    int64_t timestamp_us;

    if (state == NULL || state->lock == NULL || path == NULL) {
        return;
    }
    timestamp_us = esp_timer_get_time();
    xSemaphoreTake(state->lock, portMAX_DELAY);
    for (source = state->sources; source != NULL; source = source->next) {
        memset(&event, 0, sizeof(event));
        event.kind = kind;
        if (esp32_mquickjs_fs_path_contains(source->path, path) ||
            (kind == ESP32_MQUICKJS_FS_CHANGE_RENAME &&
             esp32_mquickjs_fs_path_contains(source->path, to_path))) {
            snprintf(event.path, sizeof(event.path), "%s", path);
            if (kind == ESP32_MQUICKJS_FS_CHANGE_RENAME && to_path != NULL) {
                snprintf(event.to_path, sizeof(event.to_path), "%s", to_path);
            }
            event.sequence = ++source->event_sequence;
            if (event.sequence == 0) {
                event.sequence = ++source->event_sequence;
            }
            event.timestamp_us = timestamp_us;
            (void)esp32_mquickjs_event_queue_send(source->changes, &event);
        }
    }
    xSemaphoreGive(state->lock);
}

static esp32_mquickjs_littlefs_mount_t *find_littlefs_mount_by_root(
    const char *base_path)
{
    esp32_mquickjs_littlefs_mount_t *matched = NULL;
    size_t matched_length = 0;
    size_t mount_length;
    size_t i;

    if (base_path == NULL) {
        return NULL;
    }
    for (i = 0; i < ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS; i++) {
        if (!s_littlefs_mounts[i].active) {
            continue;
        }
        mount_length = strlen(s_littlefs_mounts[i].base_path);
        if (mount_length > matched_length &&
            esp32_mquickjs_fs_path_contains(s_littlefs_mounts[i].base_path, base_path)) {
            matched = &s_littlefs_mounts[i];
            matched_length = mount_length;
        }
    }
    return matched;
}

