99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
esp32_mquickjs_resource_key_t esp32_mquickjs_fs_resource_key_for_path(
    const char *path)
{
    return find_littlefs_mount_by_root(path);
}

static esp32_mquickjs_littlefs_mount_t *find_littlefs_mount_exact(
    const char *base_path)
{
    size_t i;

    if (base_path == NULL) {
        return NULL;
    }
    for (i = 0; i < ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS; ++i) {
        if (s_littlefs_mounts[i].active &&
            strcmp(s_littlefs_mounts[i].base_path, base_path) == 0) {
            return &s_littlefs_mounts[i];
        }
    }
    return NULL;
}

static bool remember_littlefs_mount(const char *partition_label,
                                    const char *base_path,
                                    bool read_only)
{
    esp32_mquickjs_littlefs_mount_t *available = NULL;
    size_t i;

    for (i = 0; i < ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS; i++) {
        if (s_littlefs_mounts[i].active &&
            strcmp(s_littlefs_mounts[i].partition_label, partition_label) == 0) {
            available = &s_littlefs_mounts[i];
            break;
        }
        if (!s_littlefs_mounts[i].active && available == NULL) {
            available = &s_littlefs_mounts[i];
        }
    }
    if (available == NULL) {
        return false;
    }
    snprintf(available->partition_label,
             sizeof(available->partition_label),
             "%s",
             partition_label);
    snprintf(available->base_path,
             sizeof(available->base_path),
             "%s",
             base_path);
    available->read_only = read_only;
    available->active = true;
    return true;
}

static void forget_littlefs_mount(const char *partition_label)
{
    size_t i;

    for (i = 0; i < ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS; i++) {
        if (!s_littlefs_mounts[i].active ||
            strcmp(s_littlefs_mounts[i].partition_label, partition_label) != 0) {
            continue;
        }
        memset(&s_littlefs_mounts[i], 0, sizeof(s_littlefs_mounts[i]));
        return;
    }
}

static const char *startup_fs_base_path(const esp32_mquickjs_runtime_t *runtime)
{
    if (runtime != NULL && runtime->startup_fs_root[0] != '\0') {
        return runtime->startup_fs_root;
    }
    return ESP32_MQUICKJS_LITTLEFS_BASE_PATH;
}

static bool fs_has_child_mount(const char *path)
{
    size_t i;

    for (i = 0; i < ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS; ++i) {
        if (s_littlefs_mounts[i].active &&
            strcmp(path, s_littlefs_mounts[i].base_path) != 0 &&
            esp32_mquickjs_fs_path_contains(path, s_littlefs_mounts[i].base_path)) {
            return true;
        }
    }
    return false;
}

static int fs_mutation_path_error(const char *path, const char *to_path)
{
    esp32_mquickjs_littlefs_mount_t *mount = find_littlefs_mount_by_root(path);

    if (mount == NULL) {
        return ENOENT;
    }
    if (to_path != NULL && mount != find_littlefs_mount_by_root(to_path)) {
        return EXDEV;
    }
    if (mount->read_only) {
        return EROFS;
    }
    if (find_littlefs_mount_exact(path) != NULL || fs_has_child_mount(path) ||
        (to_path != NULL && (find_littlefs_mount_exact(to_path) != NULL ||
                             fs_has_child_mount(to_path)))) {
        return EBUSY;
    }
    return 0;
}

static int fs_namespace_stat(const char *path, struct stat *st)
{
    if (strcmp(path, "/") == 0 || fs_has_child_mount(path)) {
        memset(st, 0, sizeof(*st));
        st->st_mode = S_IFDIR | 0755;
        return 0;
    }
    return stat(path, st);
}

static uint8_t *load_script_file(const char *path, size_t *out_len)
{
    FILE *file;
    long file_size;
    size_t read_len;
    uint8_t *buf;

    if (out_len == NULL) {
        return NULL;
    }
    *out_len = 0;

    file = fopen(path, "rb");
    if (file == NULL) {
        return NULL;
    }

    if (fseek(file, 0, SEEK_END) != 0) {
        fclose(file);
        return NULL;
    }

    file_size = ftell(file);
    if (file_size < 0 || fseek(file, 0, SEEK_SET) != 0) {
        fclose(file);
        return NULL;
    }

    buf = esp32_mquickjs_memory_payload_alloc(
        "fs.read-file", (size_t)file_size + 1U,
        ESP32_MQUICKJS_MEMORY_EXTERNAL);
    if (buf == NULL) {
        fclose(file);
        return NULL;
    }

    read_len = fread(buf, 1, (size_t)file_size, file);
    fclose(file);
    if (read_len != (size_t)file_size) {
        esp32_mquickjs_memory_payload_free(buf);
        return NULL;
    }

    buf[read_len] = '\0';
    *out_len = read_len;
    return buf;
}

static JSValue fs_throw_error(JSContext *ctx,
                              const char *action,
                              const char *path,
                              int err)
{
    if (err == ENOENT) {
        return JS_ThrowReferenceError(ctx, "%s failed for %s (%s)", action, path, strerror(err));
    }
    return JS_ThrowInternalError(ctx, "%s failed for %s (%s)", action, path, strerror(err));
}

static int js_value_to_fs_path(JSContext *ctx,
                               JSValue value,
                               const char *api_name,
                               char *out_path,
                               size_t out_path_size)
{
    JSCStringBuf path_buf;
    const char *path;

    if (!JS_IsString(ctx, value)) {
        JS_ThrowTypeError(ctx, "%s expects a filesystem path string", api_name);
        return -1;
    }

    path = JS_ToCString(ctx, value, &path_buf);
    if (!esp32_mquickjs_fs_resolve_path("/",
                                        path,
                                        out_path,
                                        out_path_size)) {
        JS_ThrowTypeError(ctx,
                          "%s expects a path within the filesystem namespace /",
                          api_name);
        return -1;
    }

    return 0;
}


static JSValue fs_make_stat_object(JSContext *ctx, const char *path, const struct stat *st)
{
    JSGCRef entry_ref;
    JSValue *entry;
    esp32_mquickjs_littlefs_mount_t *mount = find_littlefs_mount_by_root(path);

    entry = JS_PushGCRef(ctx, &entry_ref);
    *entry = JS_NewObject(ctx);
    if (JS_IsException(*entry)) {
        goto fail;
    }
    if (!esp32_mquickjs_set_property_ref(ctx, entry, "name",
                                     JS_NewString(ctx, esp32_mquickjs_fs_path_basename(path))) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "path",
                                     JS_NewString(ctx, path)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "isDir",
                                     JS_NewBool(S_ISDIR(st->st_mode))) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "mount",
                                     JS_NewBool(find_littlefs_mount_exact(path) != NULL)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "readOnly",
                                     JS_NewBool(mount == NULL || mount->read_only)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "size",
                                     JS_NewInt64(ctx, (int64_t)st->st_size))) {
        goto fail;
    }

    return JS_PopGCRef(ctx, &entry_ref);

