99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
fail:
    JS_PopGCRef(ctx, &entry_ref);
    return JS_EXCEPTION;
}

bool esp32_mquickjs_mount_littlefs(bool format_if_mount_failed,
                                   bool read_only)
{
    if (s_littlefs_mounted) {
        return true;
    }
    s_littlefs_mounted = esp32_mquickjs_mount_littlefs_partition(
        ESP32_MQUICKJS_LITTLEFS_PARTITION_LABEL,
        ESP32_MQUICKJS_LITTLEFS_BASE_PATH,
        format_if_mount_failed,
        read_only);
    return s_littlefs_mounted;
}

bool esp32_mquickjs_mount_littlefs_partition(const char *partition_label,
                                             const char *base_path,
                                             bool format_if_mount_failed,
                                             bool read_only)
{
    esp_vfs_littlefs_conf_t conf = {
        .base_path = base_path != NULL ? esp32_mquickjs_fs_vfs_prefix(base_path) : NULL,
        .partition_label = partition_label,
        .format_if_mount_failed = format_if_mount_failed,
        .read_only = read_only,
        .dont_mount = false,
    };
    esp_err_t ret;
    size_t total = 0;
    size_t used = 0;

    if (partition_label == NULL || partition_label[0] == '\0' ||
        base_path == NULL || base_path[0] != '/' ||
        strlen(partition_label) >= 17U ||
        strlen(base_path) >= ESP32_MQUICKJS_FS_ROOT_MAX ||
        strstr(base_path, "..") != NULL ||
        (strlen(base_path) > 1U && base_path[strlen(base_path) - 1U] == '/') ||
        find_littlefs_mount_exact(base_path) != NULL ||
        (read_only && format_if_mount_failed)) {
        ESP_LOGE(TAG, "Invalid LittleFS partition mount parameters");
        return false;
    }

    ret = esp_vfs_littlefs_register(&conf);
    if (ret != ESP_OK) {
        if (ret == ESP_FAIL) {
            ESP_LOGE(TAG, "Failed to mount or format LittleFS '%s'", partition_label);
        } else if (ret == ESP_ERR_NOT_FOUND) {
            ESP_LOGE(TAG, "LittleFS partition '%s' was not found",
                     partition_label);
        } else {
            ESP_LOGE(TAG, "Failed to initialize LittleFS '%s' (%s)",
                     partition_label,
                     esp_err_to_name(ret));
        }
        return false;
    }

    ret = esp_littlefs_info(partition_label, &total, &used);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG,
                 "LittleFS '%s' mounted at %s: total=%u used=%u readOnly=%s",
                 partition_label,
                 base_path,
                 (unsigned)total,
                 (unsigned)used,
                 read_only ? "true" : "false");
    } else {
        ESP_LOGW(TAG, "LittleFS '%s' mounted but size query failed (%s)",
                 partition_label,
                 esp_err_to_name(ret));
    }
    if (!remember_littlefs_mount(partition_label, base_path, read_only)) {
        ESP_LOGE(TAG, "LittleFS mount registry is full: %s", partition_label);
        esp_vfs_littlefs_unregister(partition_label);
        return false;
    }
    return true;
}

void esp32_mquickjs_unmount_littlefs_partition(const char *partition_label)
{
    if (partition_label == NULL || partition_label[0] == '\0') {
        return;
    }
    esp_vfs_littlefs_unregister(partition_label);
    forget_littlefs_mount(partition_label);
}

void esp32_mquickjs_unmount_littlefs(void)
{
    if (!s_littlefs_mounted) {
        return;
    }
    esp32_mquickjs_unmount_littlefs_partition(
        ESP32_MQUICKJS_LITTLEFS_PARTITION_LABEL);
    s_littlefs_mounted = false;
}

typedef struct {
    char root[ESP32_MQUICKJS_FS_ROOT_MAX];
    uint16_t depth;
} fs_load_context_t;

static bool fs_enter_load(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
                           const char *root, fs_load_context_t *previous)
{
    if (runtime == NULL || runtime->load_root_depth == UINT16_MAX) {
        JS_ThrowInternalError(ctx, "script load context is unavailable");
        return false;
    }
    memcpy(previous->root, runtime->load_root, sizeof(previous->root));
    previous->depth = runtime->load_root_depth;
    snprintf(runtime->load_root, sizeof(runtime->load_root), "%s", root);
    runtime->load_root_depth++;
    return true;
}

static void fs_leave_load(esp32_mquickjs_runtime_t *runtime,
                           const fs_load_context_t *previous)
{
    memcpy(runtime->load_root, previous->root, sizeof(runtime->load_root));
    runtime->load_root_depth = previous->depth;
}

static JSValue load_from_fs(JSContext *ctx,
                            esp32_mquickjs_runtime_t *runtime,
                            const char *base_path,
                            const char *script_path)
{
    char resolved_path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    size_t source_len = 0;
    uint8_t *source;
    JSValue result;
    fs_load_context_t previous;
    esp32_mquickjs_littlefs_mount_t *mount;

    if (!esp32_mquickjs_fs_resolve_path(base_path, script_path,
                                        resolved_path, sizeof(resolved_path))) {
        return JS_ThrowTypeError(ctx, "load(path) expects a path within /");
    }
    mount = find_littlefs_mount_by_root(resolved_path);
    if (mount == NULL) {
        return JS_ThrowReferenceError(ctx, "script filesystem is unavailable: %s", resolved_path);
    }
    source = load_script_file(resolved_path, &source_len);
    if (source == NULL) {
        return JS_ThrowReferenceError(ctx, "failed to read script: %s", resolved_path);
    }
    if (!fs_enter_load(ctx, runtime, mount->base_path, &previous)) {
        esp32_mquickjs_memory_payload_free(source);
        return JS_EXCEPTION;
    }
    result = esp32_mquickjs_eval(ctx, runtime, (const char *)source, resolved_path, 0);
    fs_leave_load(runtime, &previous);
    esp32_mquickjs_memory_payload_free(source);
    return result;
}

JSValue esp32_mquickjs_load_from_active_fs(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime,
                                           const char *script_path)
{
    const char *root = "/";

    if (runtime != NULL && runtime->load_root_depth > 0 &&
        runtime->load_root[0] != '\0') {
        root = runtime->load_root;
    }
    return load_from_fs(ctx, runtime, root, script_path);
}

JSValue esp32_mquickjs_load_startup_from_active_fs(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    const char *script_path)
{
    char resolved_path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    size_t source_len = 0;
    uint8_t *source;
    JSValue compiled;
    JSValue result;
    const char *startup_root = startup_fs_base_path(runtime);
    fs_load_context_t previous;

    if (runtime == NULL || runtime->startup_bytecode != NULL) {
        return JS_ThrowInternalError(ctx, "startup bytecode is already loaded");
    }

    if (!esp32_mquickjs_fs_resolve_path(startup_root,
                                        script_path,
                                        resolved_path,
                                        sizeof(resolved_path))) {
        return JS_ThrowTypeError(ctx,
                                 "startup script path must stay within the filesystem namespace /");
    }

    source = load_script_file(resolved_path, &source_len);
    if (source == NULL) {
        return JS_ThrowReferenceError(ctx, "failed to read startup script: %s", resolved_path);
    }
    if (!JS_IsBytecode(source, source_len)) {
        if (!fs_enter_load(ctx, runtime, startup_root, &previous)) {
            esp32_mquickjs_memory_payload_free(source);
            return JS_EXCEPTION;
        }
        result = esp32_mquickjs_eval(ctx, runtime, (const char *)source, resolved_path, 0);
        fs_leave_load(runtime, &previous);
        esp32_mquickjs_memory_payload_free(source);
        return result;
    }

    if (JS_RelocateBytecode(ctx, source, (uint32_t)source_len) != 0) {
        esp32_mquickjs_memory_payload_free(source);
        return JS_ThrowInternalError(ctx, "failed to relocate startup bytecode");
    }
    compiled = JS_LoadBytecode(ctx, source);
    if (JS_IsException(compiled)) {
        esp32_mquickjs_memory_payload_free(source);
        return compiled;
    }

