99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
    /* MQuickJS executes directly from this buffer and its atom table. */
    runtime->startup_bytecode = source;
    ESP_LOGI(TAG,
             "Loaded precompiled startup bytecode: path=%s bytes=%u",
             resolved_path,
             (unsigned)source_len);
    if (!fs_enter_load(ctx, runtime, startup_root, &previous)) {
        return JS_EXCEPTION;
    }
    result = esp32_mquickjs_run(ctx, runtime, compiled);
    fs_leave_load(runtime, &previous);
    return result;
}

JSValue esp32_mquickjs_load_from_root(JSContext *ctx,
                                      esp32_mquickjs_runtime_t *runtime,
                                      const char *base_path,
                                      const char *script_path)
{
    return load_from_fs(ctx,
                        runtime,
                        base_path,
                        script_path);
}

JSValue js_fs_get_root(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewString(ctx, "/");
}

static JSValue fs_make_mount_object(JSContext *ctx,
                                     const esp32_mquickjs_littlefs_mount_t *mount)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "root",
                                         JS_NewString(ctx, mount->base_path)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "partition",
                                         JS_NewString(ctx, mount->partition_label)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "type",
                                         JS_NewString(ctx, "littlefs")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "readOnly",
                                         JS_NewBool(mount->read_only))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_fs_mounts(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef result_ref;
    JSValue *result;
    uint32_t count = 0;
    size_t i;

    (void)this_val;
    (void)argv;
    if (argc != 0) {
        return JS_ThrowTypeError(ctx, "fs.mounts() expects no arguments");
    }
    result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewArray(ctx, 0);
    if (JS_IsException(*result)) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    for (i = 0; i < ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS; ++i) {
        if (s_littlefs_mounts[i].active) {
            JSValue entry = fs_make_mount_object(ctx, &s_littlefs_mounts[i]);

            if (JS_IsException(entry) ||
                JS_IsException(JS_SetPropertyUint32(ctx, *result, count++, entry))) {
                JS_PopGCRef(ctx, &result_ref);
                return JS_EXCEPTION;
            }
        }
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_fs_info(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    char path[ESP32_MQUICKJS_MAX_SCRIPT_PATH] = "/";
    esp32_mquickjs_littlefs_mount_t *mount;
    size_t total = 0;
    size_t used = 0;
    JSGCRef result_ref;
    JSValue *result;
    esp_err_t ret;

    (void)this_val;
    if (argc > 1) {
        return JS_ThrowTypeError(ctx, "fs.info(path?) expects at most one argument");
    }
    if (argc == 1 && !JS_IsUndefined(argv[0]) &&
        js_value_to_fs_path(ctx, argv[0], "fs.info(path?)", path, sizeof(path)) != 0) {
        return JS_EXCEPTION;
    }
    mount = find_littlefs_mount_by_root(path);
    if (mount == NULL) {
        return JS_ThrowInternalError(ctx,
                                     "filesystem information is unavailable for %s",
                                     path);
    }
    ret = esp_littlefs_info(mount->partition_label, &total, &used);
    if (ret != ESP_OK) {
        return JS_ThrowInternalError(ctx,
                                     "filesystem information query failed for %s (%s)",
                                     path,
                                     esp_err_to_name(ret));
    }

    result = JS_PushGCRef(ctx, &result_ref);
    *result = fs_make_mount_object(ctx, mount);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         result,
                                         "totalBytes",
                                         JS_NewInt64(ctx, (int64_t)total)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         result,
                                         "usedBytes",
                                         JS_NewInt64(ctx, (int64_t)used)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         result,
                                         "freeBytes",
                                         JS_NewInt64(ctx,
                                                     (int64_t)(total >= used
                                                                   ? total - used
                                                                   : 0U)))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static bool fs_parse_watch_options(JSContext *ctx,
                                   int argc,
                                   JSValue *argv,
                                   uint32_t *capacity)
{
    JSGCRef value_ref;
    JSValue *value;
    static const char *const allowed[] = {"capacity"};
    uint32_t parsed_capacity;

    if (capacity == NULL) {
        return false;
    }
    *capacity = ESP32_MQUICKJS_FS_CHANGE_QUEUE_LEN;
    if (argc == 0 || JS_IsUndefined(argv[0])) {
        return true;
    }
    if (argc != 1 ||
        !esp32_mquickjs_validate_plain_options(
            ctx, argv[0], "fs.watch(path?, options?)", allowed, 1)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "fs.watch(path?, options?) expects { capacity? }");
        }
        return false;
    }

    value = JS_PushGCRef(ctx, &value_ref);
    *value = JS_GetPropertyStr(ctx, argv[0], "capacity");
    if (!JS_IsUndefined(*value) &&
        !esp32_mquickjs_value_to_bounded_u32(
            ctx, *value, 1U, ESP32_MQUICKJS_FS_CHANGE_QUEUE_MAX_LEN,
            &parsed_capacity)) {
        JS_ThrowRangeError(
            ctx, "fs.watch(path?, { capacity }) expects an integer in 1..%u",
            (unsigned)ESP32_MQUICKJS_FS_CHANGE_QUEUE_MAX_LEN);
        JS_PopGCRef(ctx, &value_ref);
        return false;
    }
    if (!JS_IsUndefined(*value)) {
        *capacity = parsed_capacity;
    }
    JS_PopGCRef(ctx, &value_ref);
    return true;
}

JSValue js_fs_watch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_fs_runtime_t *state = fs_runtime(runtime);
    char path[ESP32_MQUICKJS_MAX_SCRIPT_PATH] = "/";
    JSGCRef queue_ref;
    JSValue *queue_object;
    esp32_mquickjs_event_queue_t *changes;
    esp32_mquickjs_fs_change_source_t *source;
    uint32_t capacity;

    (void)this_val;
    if (argc > 2) {
        return JS_ThrowTypeError(ctx, "fs.watch(path?, options?) expects at most two arguments");
    }
    if (argc > 0 && !JS_IsUndefined(argv[0]) &&
        js_value_to_fs_path(ctx, argv[0], "fs.watch(path?, options?)",
                             path, sizeof(path)) != 0) {
        return JS_EXCEPTION;
    }
    if (!fs_parse_watch_options(ctx, argc > 1 ? 1 : 0,
                                  argc > 1 ? argv + 1 : NULL, &capacity)) {
        return JS_EXCEPTION;
    }
    if (state == NULL || state->lock == NULL) {
        return JS_ThrowInternalError(ctx, "fs.watch() requires an active filesystem runtime");
    }
    source = heap_caps_calloc(1, sizeof(*source), MALLOC_CAP_8BIT);
    if (source == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    source->owner = state;
    snprintf(source->path, sizeof(source->path), "%s", path);

    queue_object = JS_PushGCRef(ctx, &queue_ref);
    *queue_object = esp32_mquickjs_event_queue_new(
        ctx,
        runtime,
        sizeof(esp32_mquickjs_fs_change_event_t),
        capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_OLDEST,
        fs_change_to_js,
        NULL,
        fs_change_queue_closed,
        source);
    if (JS_IsException(*queue_object)) {
        heap_caps_free(source);
        JS_PopGCRef(ctx, &queue_ref);
        return JS_EXCEPTION;
    }
    changes = esp32_mquickjs_event_queue_from_value(ctx, *queue_object);
    if (changes == NULL) {
        JS_PopGCRef(ctx, &queue_ref);
        return JS_ThrowInternalError(ctx, "fs.watch() could not create its change queue");
    }

    xSemaphoreTake(state->lock, portMAX_DELAY);
    source->changes = changes;
    source->next = state->sources;
    state->sources = source;
    xSemaphoreGive(state->lock);
    return JS_PopGCRef(ctx, &queue_ref);
}

JSValue js_framework_load(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    JSCStringBuf path_buf;
    const char *path;
    char resolved_path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];

    (void)this_val;
    if (argc < 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "framework.load(path) expects a script path");
    }
    if (runtime == NULL) {
        return JS_ThrowInternalError(ctx, "JavaScript runtime is not active");
    }
    if (!s_littlefs_mounted || runtime->load_root_depth == UINT16_MAX) {
        return JS_ThrowInternalError(ctx, "framework filesystem is not available");
    }
    path = JS_ToCString(ctx, argv[0], &path_buf);
    if (path == NULL ||
        !esp32_mquickjs_fs_resolve_path(ESP32_MQUICKJS_LITTLEFS_BASE_PATH "/_sys",
                                         path, resolved_path, sizeof(resolved_path)) ||
        !esp32_mquickjs_fs_path_contains(ESP32_MQUICKJS_LITTLEFS_BASE_PATH "/_sys",
                                          resolved_path)) {
        return JS_ThrowTypeError(ctx, "framework.load(path) expects a system library path");
    }
    return esp32_mquickjs_load_from_root(ctx, runtime, "/", resolved_path);
}

#define ESP32_MQUICKJS_FS_FUTURE_MAX_ENTRIES 64U

