99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
typedef enum {
    FS_FUTURE_OPEN,
    FS_FUTURE_LIST,
    FS_FUTURE_STAT,
    FS_FUTURE_EXISTS,
    FS_FUTURE_READ_TEXT,
    FS_FUTURE_WRITE_TEXT,
    FS_FUTURE_APPEND_TEXT,
    FS_FUTURE_REMOVE,
    FS_FUTURE_RENAME,
    FS_FUTURE_MKDIR,
} fs_future_kind_t;

typedef struct {
    char path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    struct stat stat_value;
} fs_future_entry_t;

struct esp32_mquickjs_future_driver_state {
    fs_future_kind_t kind;
    char path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    char to_path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    char mode[8];
    FILE *file;
    char *data;
    size_t data_length;
    size_t max_bytes;
    size_t actual_bytes;
    struct stat stat_value;
    fs_future_entry_t *entries;
    size_t entry_count;
    int error_number;
    bool result;
    bool opened_mutation;
    esp32_mquickjs_resource_key_t resource_key;
    _Atomic bool completed;
    bool cancelled;
};

static JSValue fs_throw_read_limit_error(
    JSContext *ctx,
    const esp32_mquickjs_future_driver_state_t *state)
{
    JSGCRef error_ref;
    JSValue *error;

    (void)JS_ThrowRangeError(
        ctx, "readText() refused %s because it exceeds maxBytes (%u)",
        state->path, (unsigned)state->max_bytes);
    if (!JS_HasException(ctx)) {
        return JS_EXCEPTION;
    }
    error = JS_PushGCRef(ctx, &error_ref);
    *error = JS_GetException(ctx);
    if (JS_GetClassID(ctx, *error) >= 0 &&
        (JS_IsException(JS_SetPropertyStr(
             ctx, *error, "code",
             JS_NewString(ctx, "FS_READ_LIMIT_EXCEEDED"))) ||
         JS_IsException(JS_SetPropertyStr(
             ctx, *error, "path", JS_NewString(ctx, state->path))) ||
         JS_IsException(JS_SetPropertyStr(
             ctx, *error, "maxBytes",
             JS_NewUint32(ctx, (uint32_t)state->max_bytes))) ||
         JS_IsException(JS_SetPropertyStr(
             ctx, *error, "actualBytes",
             JS_NewUint32(ctx, (uint32_t)state->actual_bytes))))) {
        JS_PopGCRef(ctx, &error_ref);
        return JS_EXCEPTION;
    }
    return JS_Throw(ctx, JS_PopGCRef(ctx, &error_ref));
}

static bool fs_number_to_bounded_size(JSContext *ctx,
                                      JSValue value,
                                      size_t minimum,
                                      size_t maximum,
                                      size_t *result)
{
    double number;
    size_t converted;

    if (result == NULL || !JS_IsNumber(ctx, value) ||
        JS_ToNumber(ctx, &number, value) != 0 || !isfinite(number) ||
        number < (double)minimum || number > (double)maximum) {
        return false;
    }
    converted = (size_t)number;
    if ((double)converted != number) {
        return false;
    }
    *result = converted;
    return true;
}

static bool fs_parse_read_text_options(JSContext *ctx,
                                       int argc,
                                       JSGCRef *argv,
                                       size_t *max_bytes)
{
    JSGCRef value_ref;
    JSValue *value;
    static const char *const allowed[] = {"maxBytes"};

    if (max_bytes == NULL) {
        return false;
    }
    *max_bytes = CONFIG_ESP32_MQUICKJS_FS_READ_TEXT_MAX_BYTES;
    if (argc < 2 || JS_IsUndefined(argv[1].val) || JS_IsNull(argv[1].val)) {
        return true;
    }
    if (!esp32_mquickjs_validate_plain_options(
            ctx, argv[1].val, "fs.readText(path, options?)", allowed, 1)) {
        return false;
    }

    value = JS_PushGCRef(ctx, &value_ref);
    *value = JS_GetPropertyStr(ctx, argv[1].val, "maxBytes");
    if (!JS_IsUndefined(*value) &&
        !fs_number_to_bounded_size(
            ctx, *value, 1U,
            CONFIG_ESP32_MQUICKJS_FS_READ_TEXT_MAX_BYTES, max_bytes)) {
        JS_ThrowRangeError(
            ctx,
            "fs.readText(path, { maxBytes }) expects an integer in 1..%u",
            (unsigned)CONFIG_ESP32_MQUICKJS_FS_READ_TEXT_MAX_BYTES);
        goto fail;
    }
    JS_PopGCRef(ctx, &value_ref);
    return true;

fail:
    JS_PopGCRef(ctx, &value_ref);
    return false;
}

static bool fs_stream_mode_valid(const char *mode)
{
    return mode != NULL &&
           (strcmp(mode, "r") == 0 || strcmp(mode, "rb") == 0 ||
            strcmp(mode, "w") == 0 || strcmp(mode, "wb") == 0 ||
            strcmp(mode, "a") == 0 || strcmp(mode, "ab") == 0 ||
            strcmp(mode, "r+") == 0 || strcmp(mode, "rb+") == 0 ||
            strcmp(mode, "r+b") == 0 || strcmp(mode, "w+") == 0 ||
            strcmp(mode, "wb+") == 0 || strcmp(mode, "w+b") == 0 ||
            strcmp(mode, "a+") == 0 || strcmp(mode, "ab+") == 0 ||
            strcmp(mode, "a+b") == 0);
}

static void fs_future_release(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    esp32_mquickjs_memory_payload_free(state->data);
    esp32_mquickjs_memory_payload_free(state->entries);
    if (state->file != NULL) {
        fclose(state->file);
    }
    heap_caps_free(state);
}

static bool fs_future_prepare_common(
    JSContext *ctx,
    JSGCRef *receiver_ref,
    fs_future_kind_t kind,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    const char *api_name;
    esp32_mquickjs_littlefs_mount_t *mount;
    int path_error = 0;
    bool mutating;

    if (out_state == NULL) {
        return false;
    }
    api_name = kind == FS_FUTURE_OPEN ? "fs.open(path, mode?)" :
               kind == FS_FUTURE_LIST ? "fs.list(path?)" :
               kind == FS_FUTURE_STAT ? "fs.stat(path)" :
               kind == FS_FUTURE_EXISTS ? "fs.exists(path)" :
               kind == FS_FUTURE_READ_TEXT ? "fs.readText(path, options?)" :
               kind == FS_FUTURE_WRITE_TEXT ? "fs.writeText(path, text)" :
               kind == FS_FUTURE_APPEND_TEXT ? "fs.appendText(path, text)" :
               kind == FS_FUTURE_REMOVE ? "fs.remove(path)" :
               kind == FS_FUTURE_RENAME ? "fs.rename(fromPath, toPath)" :
               "fs.mkdir(path)";
    if ((kind == FS_FUTURE_OPEN && (argc < 1 || argc > 2)) ||
        (kind == FS_FUTURE_LIST && argc > 1) ||
        (kind == FS_FUTURE_READ_TEXT && (argc < 1 || argc > 2)) ||
        (kind != FS_FUTURE_OPEN && kind != FS_FUTURE_LIST &&
         kind != FS_FUTURE_RENAME && kind != FS_FUTURE_READ_TEXT &&
         kind != FS_FUTURE_WRITE_TEXT && kind != FS_FUTURE_APPEND_TEXT &&
         argc != 1) ||
        (kind == FS_FUTURE_RENAME && argc != 2) ||
        ((kind == FS_FUTURE_WRITE_TEXT || kind == FS_FUTURE_APPEND_TEXT) && argc != 2)) {
        JS_ThrowTypeError(ctx, "%s received invalid arguments", api_name);
        return false;
    }
    (void)receiver_ref;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    atomic_init(&state->completed, false);
    state->kind = kind;
    if (kind == FS_FUTURE_OPEN) {
        JSCStringBuf mode_buf;
        const char *mode = "r";

