99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
        if (argc == 2 && !JS_IsUndefined(argv[1].val) &&
            !JS_IsNull(argv[1].val)) {
            if (!JS_IsString(ctx, argv[1].val)) {
                fs_future_release(state);
                JS_ThrowTypeError(ctx, "%s expects mode to be a string", api_name);
                return false;
            }
            mode = JS_ToCString(ctx, argv[1].val, &mode_buf);
            if (mode == NULL) {
                fs_future_release(state);
                return false;
            }
        }
        if (strlen(mode) >= sizeof(state->mode)) {
            fs_future_release(state);
            JS_ThrowTypeError(ctx, "unsupported stream mode: %s", mode);
            return false;
        }
        if (!fs_stream_mode_valid(mode)) {
            fs_future_release(state);
            JS_ThrowTypeError(ctx, "unsupported stream mode: %s", mode);
            return false;
        }
        snprintf(state->mode, sizeof(state->mode), "%s", mode);
    }
    if (kind == FS_FUTURE_LIST && argc == 0) {
        snprintf(state->path, sizeof(state->path), "/");
    } else if (js_value_to_fs_path(ctx, argv[0].val, api_name,
                                   state->path, sizeof(state->path)) != 0) {
        fs_future_release(state);
        return false;
    }
    if (kind == FS_FUTURE_RENAME &&
        js_value_to_fs_path(ctx, argv[1].val, api_name,
                            state->to_path, sizeof(state->to_path)) != 0) {
        fs_future_release(state);
        return false;
    }
    mount = find_littlefs_mount_by_root(state->path);
    state->resource_key = mount != NULL ? (void *)mount : &s_fs_namespace_resource;
    mutating = kind == FS_FUTURE_WRITE_TEXT || kind == FS_FUTURE_APPEND_TEXT ||
               kind == FS_FUTURE_REMOVE || kind == FS_FUTURE_RENAME ||
               kind == FS_FUTURE_MKDIR ||
               (kind == FS_FUTURE_OPEN &&
                (state->mode[0] != 'r' || strchr(state->mode, '+') != NULL));
    if (mutating) {
        path_error = fs_mutation_path_error(
            state->path, kind == FS_FUTURE_RENAME ? state->to_path : NULL);
    }
    if (path_error != 0) {
        (void)fs_throw_error(ctx, api_name, state->path, path_error);
        fs_future_release(state);
        return false;
    }
    if (kind == FS_FUTURE_READ_TEXT &&
        !fs_parse_read_text_options(ctx, argc, argv, &state->max_bytes)) {
        fs_future_release(state);
        return false;
    }
    if (kind == FS_FUTURE_WRITE_TEXT || kind == FS_FUTURE_APPEND_TEXT) {
        JSCStringBuf text_buf;
        const char *text;

        if (!JS_IsString(ctx, argv[1].val)) {
            fs_future_release(state);
            JS_ThrowTypeError(ctx, "%s expects a text string", api_name);
            return false;
        }
        text = JS_ToCStringLen(ctx, &state->data_length, argv[1].val, &text_buf);
        if (text == NULL) {
            fs_future_release(state);
            return false;
        }
        state->data = esp32_mquickjs_memory_payload_alloc(
            "fs.write-file", state->data_length + 1U,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (state->data == NULL) {
            fs_future_release(state);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        memcpy(state->data, text, state->data_length);
        state->data[state->data_length] = '\0';
    }
    *out_state = state;
    return true;
}

#define FS_PREPARE(name, kind_value) \
    static bool name(JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv, \
                     esp32_mquickjs_future_driver_state_t **out_state) \
    { \
        return fs_future_prepare_common(ctx, this_ref, kind_value, argc, \
                                        argv, out_state); \
    }

FS_PREPARE(fs_list_future_prepare, FS_FUTURE_LIST)
FS_PREPARE(fs_open_future_prepare, FS_FUTURE_OPEN)
FS_PREPARE(fs_stat_future_prepare, FS_FUTURE_STAT)
FS_PREPARE(fs_exists_future_prepare, FS_FUTURE_EXISTS)
FS_PREPARE(fs_read_text_future_prepare, FS_FUTURE_READ_TEXT)
FS_PREPARE(fs_write_text_future_prepare, FS_FUTURE_WRITE_TEXT)
FS_PREPARE(fs_append_text_future_prepare, FS_FUTURE_APPEND_TEXT)
FS_PREPARE(fs_remove_future_prepare, FS_FUTURE_REMOVE)
FS_PREPARE(fs_rename_future_prepare, FS_FUTURE_RENAME)
FS_PREPARE(fs_mkdir_future_prepare, FS_FUTURE_MKDIR)

#undef FS_PREPARE

static int fs_read_text_bounded(
    esp32_mquickjs_future_driver_state_t *state)
{
    FILE *file;
    struct stat stat_value;
    size_t capacity;
    size_t length = 0;
    char *data;
    int result = 0;

    file = fopen(state->path, "rb");
    if (file == NULL) {
        return errno != 0 ? errno : EIO;
    }
    if (fstat(fileno(file), &stat_value) != 0) {
        result = errno != 0 ? errno : EIO;
        goto done;
    }
    if (stat_value.st_size < 0) {
        result = EIO;
        goto done;
    }
    state->actual_bytes = (size_t)stat_value.st_size;
    if ((uint64_t)stat_value.st_size > (uint64_t)state->max_bytes) {
        result = EFBIG;
        goto done;
    }

    capacity = (size_t)stat_value.st_size;
    if (capacity == 0) {
        capacity = 1U;
    }
    data = esp32_mquickjs_memory_payload_alloc(
        "fs.read-text", capacity + 1U,
        ESP32_MQUICKJS_MEMORY_EXTERNAL);
    if (data == NULL) {
        result = ENOMEM;
        goto done;
    }

    for (;;) {
        size_t available = capacity - length;
        size_t read_length;

        if (available == 0) {
            if (capacity >= state->max_bytes) {
                int extra = fgetc(file);

                if (extra != EOF) {
                    state->actual_bytes = state->max_bytes + 1U;
                    result = EFBIG;
                } else if (ferror(file)) {
                    result = errno != 0 ? errno : EIO;
                }
                break;
            }
            {
                size_t next_capacity = capacity > state->max_bytes / 2U
                                           ? state->max_bytes
                                           : capacity * 2U;
                char *grown = esp32_mquickjs_memory_payload_realloc(
                    "fs.read-text", data, next_capacity + 1U,
                    ESP32_MQUICKJS_MEMORY_EXTERNAL);

                if (grown == NULL) {
                    result = ENOMEM;
                    break;
                }
                data = grown;
                capacity = next_capacity;
                continue;
            }
        }

        read_length = fread(data + length, 1, available, file);
        length += read_length;
        if (read_length < available) {
            if (ferror(file)) {
                result = errno != 0 ? errno : EIO;
            }
            break;
        }
    }

    if (result == 0) {
        data[length] = '\0';
        state->data = data;
        state->data_length = length;
        state->actual_bytes = length;
        data = NULL;
    }
    esp32_mquickjs_memory_payload_free(data);

done:
    if (fclose(file) != 0 && result == 0) {
        result = errno != 0 ? errno : EIO;
    }
    return result;
}

static uint32_t fs_atomic_path_hash(const char *path)
{
    const uint8_t *cursor = (const uint8_t *)path;
    uint32_t hash = 2166136261U;

    while (cursor != NULL && *cursor != '\0') {
        hash ^= *cursor++;
        hash *= 16777619U;
    }
    return hash;
}

static int fs_open_atomic_temp(const char *path,
                               char *temp_path,
                               size_t temp_path_size,
                               FILE **out_file)
{
    const char *separator = strrchr(path, '/');
    size_t directory_length;
    uint32_t hash;
    uint32_t attempt;

    if (separator == NULL || separator == path || temp_path == NULL ||
        out_file == NULL) {
        return EINVAL;
    }
    directory_length = (size_t)(separator - path);
    hash = fs_atomic_path_hash(path);
    *out_file = NULL;
    for (attempt = 0; attempt < ESP32_MQUICKJS_FS_ATOMIC_TEMP_ATTEMPTS;
         ++attempt) {
        uint32_t counter = atomic_fetch_add_explicit(
            &s_fs_atomic_temp_counter, 1U, memory_order_relaxed);
        int needed = snprintf(temp_path, temp_path_size,
                              "%.*s/.qjs-%08" PRIx32 "-%08" PRIx32 ".tmp",
                              (int)directory_length, path, hash, counter);
        int fd;

