99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
        if (needed <= 0 || (size_t)needed >= temp_path_size) {
            return ENAMETOOLONG;
        }
        fd = open(temp_path, O_WRONLY | O_CREAT | O_EXCL | O_TRUNC, 0600);
        if (fd >= 0) {
            *out_file = fdopen(fd, "wb");
            if (*out_file == NULL) {
                int open_error = errno != 0 ? errno : EIO;

                close(fd);
                unlink(temp_path);
                return open_error;
            }
            return 0;
        }
        if (errno != EEXIST) {
            return errno != 0 ? errno : EIO;
        }
    }
    return EEXIST;
}

static int fs_write_file_and_sync(FILE *file,
                                  const char *data,
                                  size_t data_length)
{
    size_t written = 0;
    int result = 0;

    while (written < data_length) {
        size_t chunk = fwrite(data + written, 1, data_length - written, file);

        if (chunk == 0) {
            result = errno != 0 ? errno : EIO;
            break;
        }
        written += chunk;
    }
    if (result == 0 && fflush(file) != 0) {
        result = errno != 0 ? errno : EIO;
    }
    if (result == 0 && fsync(fileno(file)) != 0) {
        result = errno != 0 ? errno : EIO;
    }
    if (fclose(file) != 0 && result == 0) {
        result = errno != 0 ? errno : EIO;
    }
    return result;
}

static int fs_atomic_open_adapter(const char *target_path,
                                  char *temp_path,
                                  size_t temp_path_size,
                                  void **out_handle,
                                  void *opaque)
{
    FILE *file = NULL;
    int result;

    (void)opaque;
    result = fs_open_atomic_temp(
        target_path, temp_path, temp_path_size, &file);
    if (out_handle != NULL) {
        *out_handle = file;
    }
    return result;
}

static int fs_atomic_write_sync_close_adapter(void *handle,
                                              const char *data,
                                              size_t data_length,
                                              void *opaque)
{
    (void)opaque;
    return fs_write_file_and_sync(handle, data, data_length);
}

static int fs_atomic_replace_adapter(const char *temp_path,
                                     const char *target_path,
                                     void *opaque)
{
    (void)opaque;
    return rename(temp_path, target_path) == 0
               ? 0
               : (errno != 0 ? errno : EIO);
}

static void fs_atomic_remove_adapter(const char *temp_path, void *opaque)
{
    (void)opaque;
    (void)unlink(temp_path);
}

static int fs_write_text_atomic(
    const esp32_mquickjs_future_driver_state_t *state)
{
    static const esp32_mquickjs_fs_atomic_write_ops_t ops = {
        .open_temp = fs_atomic_open_adapter,
        .write_sync_close = fs_atomic_write_sync_close_adapter,
        .replace = fs_atomic_replace_adapter,
        .remove_temp = fs_atomic_remove_adapter,
    };
    char temp_path[ESP32_MQUICKJS_MAX_SCRIPT_PATH];

    return esp32_mquickjs_fs_atomic_write(
        state->path, state->data, state->data_length,
        temp_path, sizeof(temp_path), &ops, NULL);
}

static bool fs_list_add_entry(esp32_mquickjs_future_driver_state_t *state,
                               const char *path)
{
    fs_future_entry_t *grown;
    fs_future_entry_t *entry;
    size_t i;

    for (i = 0; i < state->entry_count; ++i) {
        if (strcmp(state->entries[i].path, path) == 0) {
            return true;
        }
    }
    if (state->entry_count >= ESP32_MQUICKJS_FS_FUTURE_MAX_ENTRIES) {
        state->error_number = E2BIG;
        return false;
    }
    grown = esp32_mquickjs_memory_payload_realloc(
        "fs.read-dir", state->entries,
        (state->entry_count + 1U) * sizeof(*state->entries),
        ESP32_MQUICKJS_MEMORY_EXTERNAL);
    if (grown == NULL) {
        state->error_number = ENOMEM;
        return false;
    }
    state->entries = grown;
    entry = &state->entries[state->entry_count];
    snprintf(entry->path, sizeof(entry->path), "%s", path);
    if (fs_namespace_stat(path, &entry->stat_value) != 0) {
        state->error_number = errno;
        return false;
    }
    state->entry_count++;
    return true;
}

static void fs_list_namespace(esp32_mquickjs_future_driver_state_t *state)
{
    DIR *dir = opendir(state->path);
    char child[ESP32_MQUICKJS_MAX_SCRIPT_PATH];
    size_t i;

    if (dir == NULL && ((errno != ENOENT && errno != ENOTDIR) ||
        (!fs_has_child_mount(state->path) && strcmp(state->path, "/") != 0))) {
        state->error_number = errno;
        return;
    }
    /* Mounts shadow underlying names, without creating directories on flash. */
    for (i = 0; i < ESP32_MQUICKJS_MAX_LITTLEFS_MOUNTS; ++i) {
        if (s_littlefs_mounts[i].active &&
            esp32_mquickjs_fs_mount_child(state->path, s_littlefs_mounts[i].base_path,
                                           child, sizeof(child)) &&
            !fs_list_add_entry(state, child)) {
            break;
        }
    }
    if (dir != NULL) {
        struct dirent *raw;

        while (state->error_number == 0 && (raw = readdir(dir)) != NULL) {
            if (strcmp(raw->d_name, ".") == 0 || strcmp(raw->d_name, "..") == 0) {
                continue;
            }
            if (!esp32_mquickjs_fs_resolve_path(state->path, raw->d_name,
                                                 child, sizeof(child))) {
                state->error_number = ENAMETOOLONG;
                break;
            }
            if (!fs_list_add_entry(state, child)) {
                break;
            }
        }
        closedir(dir);
    }
}

static void fs_future_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state == NULL) {
        return;
    }
    errno = 0;
    if (state->kind == FS_FUTURE_OPEN) {
        bool path_existed = access(state->path, F_OK) == 0;

        state->file = fopen(state->path, state->mode);
        if (state->file == NULL) {
            state->error_number = errno;
        } else {
            state->opened_mutation =
                state->mode[0] == 'w' ||
                (state->mode[0] == 'a' && !path_existed);
        }
    } else if (state->kind == FS_FUTURE_LIST) {
        fs_list_namespace(state);
    } else if (state->kind == FS_FUTURE_STAT || state->kind == FS_FUTURE_EXISTS) {
        state->result = fs_namespace_stat(state->path, &state->stat_value) == 0;
        if (!state->result && state->kind == FS_FUTURE_STAT) {
            state->error_number = errno;
        }
    } else if (state->kind == FS_FUTURE_READ_TEXT) {
        state->error_number = fs_read_text_bounded(state);
    } else if (state->kind == FS_FUTURE_WRITE_TEXT) {
        state->error_number = fs_write_text_atomic(state);
        if (state->error_number == 0) {
            esp32_mquickjs_fs_notify_change(
                ESP32_MQUICKJS_FS_CHANGE_WRITE, state->path, NULL);
        }
    } else if (state->kind == FS_FUTURE_APPEND_TEXT) {
        bool path_existed = access(state->path, F_OK) == 0;
        FILE *file = fopen(state->path, "ab");

        if (file == NULL) {
            state->error_number = errno;
        } else {
            state->error_number = fs_write_file_and_sync(
                file, state->data, state->data_length);
            if (state->error_number == 0 &&
                (!path_existed || state->data_length > 0U)) {
                esp32_mquickjs_fs_notify_change(
                    ESP32_MQUICKJS_FS_CHANGE_WRITE, state->path, NULL);
            }
        }
    } else if (state->kind == FS_FUTURE_REMOVE) {
        if (stat(state->path, &state->stat_value) != 0 ||
            (S_ISDIR(state->stat_value.st_mode)
                 ? rmdir(state->path) : remove(state->path)) != 0) {
            state->error_number = errno;
        } else {
            state->result = true;
        }
    } else if (state->kind == FS_FUTURE_RENAME) {
        if (rename(state->path, state->to_path) != 0) {
            state->error_number = errno;
        } else {
            state->result = true;
        }
    } else if (mkdir(state->path, 0777) != 0) {
        state->error_number = errno;
    } else {
        state->result = true;
    }
    if (state->error_number == 0 && state->kind == FS_FUTURE_REMOVE) {
        esp32_mquickjs_fs_notify_change(
            ESP32_MQUICKJS_FS_CHANGE_REMOVE, state->path, NULL);
    } else if (state->error_number == 0 && state->kind == FS_FUTURE_RENAME) {
        esp32_mquickjs_fs_notify_change(
            ESP32_MQUICKJS_FS_CHANGE_RENAME, state->path, state->to_path);
    } else if (state->error_number == 0 && state->kind == FS_FUTURE_MKDIR) {
        esp32_mquickjs_fs_notify_change(
            ESP32_MQUICKJS_FS_CHANGE_MKDIR, state->path, NULL);
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
}

static bool fs_future_start(JSContext *ctx,
                            esp32_mquickjs_runtime_t *runtime,
                            esp32_mquickjs_future_token_t token,
                            esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return false;
    }
    if (!esp32_mquickjs_future_submit_worker(runtime, token,
                                             fs_future_worker, state)) {
        JS_ThrowInternalError(ctx, "filesystem Future worker queue is busy");
        return false;
    }
    return true;
}

