99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/fs/esp32_mquickjs_fs.c
static esp32_mquickjs_future_poll_t fs_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && atomic_load_explicit(
                                &state->completed, memory_order_acquire)
        ? ESP32_MQUICKJS_FUTURE_READY
        : ESP32_MQUICKJS_FUTURE_PENDING;
}

static const char *fs_future_action(const esp32_mquickjs_future_driver_state_t *state)
{
    return state->kind == FS_FUTURE_OPEN ? "open()" :
           state->kind == FS_FUTURE_LIST ? "list()" :
           state->kind == FS_FUTURE_STAT ? "stat()" :
           state->kind == FS_FUTURE_READ_TEXT ? "readText()" :
           state->kind == FS_FUTURE_WRITE_TEXT ? "writeText()" :
           state->kind == FS_FUTURE_APPEND_TEXT ? "appendText()" :
           state->kind == FS_FUTURE_REMOVE ? "remove()" :
           state->kind == FS_FUTURE_RENAME ? "rename()" : "mkdir()";
}

static JSValue fs_future_finish(JSContext *ctx,
                                esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "filesystem operation cancelled");
    }
    if (state->error_number != 0) {
        if (state->kind == FS_FUTURE_READ_TEXT &&
            state->error_number == EFBIG) {
            return fs_throw_read_limit_error(ctx, state);
        }
        return fs_throw_error(ctx, fs_future_action(state),
                              state->path,
                              state->error_number);
    }
    if (state->kind == FS_FUTURE_OPEN) {
        JSGCRef global_ref;
        JSValue *global_obj = JS_PushGCRef(ctx, &global_ref);
        JSValue result;

        *global_obj = JS_GetGlobalObject(ctx);
        result = JS_IsException(*global_obj)
            ? JS_EXCEPTION
            : esp32_mquickjs_stream_adopt_file(ctx, *global_obj, state->path,
                                               state->mode,
                                               state->file,
                                               state->opened_mutation);
        if (!JS_IsException(result)) {
            state->file = NULL;
        } else {
            /* adopt_file consumes the FILE handle on every path. */
            state->file = NULL;
        }
        JS_PopGCRef(ctx, &global_ref);
        return result;
    }
    if (state->kind == FS_FUTURE_LIST) {
        JSGCRef entries_ref;
        JSValue *entries = JS_PushGCRef(ctx, &entries_ref);
        uint32_t index;

        *entries = JS_NewArray(ctx, state->entry_count);
        for (index = 0; !JS_IsException(*entries) && index < state->entry_count; ++index) {
            JSValue entry = fs_make_stat_object(ctx,
                                                state->entries[index].path,
                                                &state->entries[index].stat_value);
            if (JS_IsException(entry) ||
                JS_IsException(JS_SetPropertyUint32(ctx, *entries, index, entry))) {
                JS_PopGCRef(ctx, &entries_ref);
                return JS_EXCEPTION;
            }
        }
        return JS_PopGCRef(ctx, &entries_ref);
    }
    if (state->kind == FS_FUTURE_STAT) {
        return fs_make_stat_object(ctx,
                                   state->path,
                                   &state->stat_value);
    }
    if (state->kind == FS_FUTURE_EXISTS) {
        return JS_NewBool(state->result);
    }
    if (state->kind == FS_FUTURE_READ_TEXT) {
        return JS_NewStringLen(ctx, state->data, state->data_length);
    }
    if (state->kind == FS_FUTURE_WRITE_TEXT || state->kind == FS_FUTURE_APPEND_TEXT) {
        return JS_NewInt64(ctx, (int64_t)state->data_length);
    }
    return JS_NewBool(state->result);
}

static esp32_mquickjs_cancel_result_t fs_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL ||
        atomic_load_explicit(&state->completed, memory_order_acquire) ||
        state->cancelled) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    state->cancelled = true;
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}

static void fs_future_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    fs_future_release(state);
}

static esp32_mquickjs_resource_key_t fs_future_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL ? state->resource_key : NULL;
}

#define FS_FUTURE_DRIVER(name, prepare_fn) \
    static const esp32_mquickjs_future_driver_t name = { \
        .capture = prepare_fn, \
        .start = fs_future_start, \
        .poll = fs_future_poll, \
        .finish = fs_future_finish, \
        .cancel = fs_future_cancel, \
        .destroy = fs_future_destroy, \
        .resource_key = fs_future_resource_key, \
    }

FS_FUTURE_DRIVER(s_fs_list_driver, fs_list_future_prepare);
FS_FUTURE_DRIVER(s_fs_open_driver, fs_open_future_prepare);
FS_FUTURE_DRIVER(s_fs_stat_driver, fs_stat_future_prepare);
FS_FUTURE_DRIVER(s_fs_exists_driver, fs_exists_future_prepare);
FS_FUTURE_DRIVER(s_fs_read_text_driver, fs_read_text_future_prepare);
FS_FUTURE_DRIVER(s_fs_write_text_driver, fs_write_text_future_prepare);
FS_FUTURE_DRIVER(s_fs_append_text_driver, fs_append_text_future_prepare);
FS_FUTURE_DRIVER(s_fs_remove_driver, fs_remove_future_prepare);
FS_FUTURE_DRIVER(s_fs_rename_driver, fs_rename_future_prepare);
FS_FUTURE_DRIVER(s_fs_mkdir_driver, fs_mkdir_future_prepare);

#undef FS_FUTURE_DRIVER

bool esp32_mquickjs_init_fs_runtime(JSContext *ctx,
                                    esp32_mquickjs_runtime_t *runtime)
{
    static const char *names[] = {
        "open", "list", "stat", "exists", "readText", "writeText",
        "appendText", "remove", "rename", "mkdir",
    };
    static const esp32_mquickjs_future_driver_t *drivers[] = {
        &s_fs_open_driver, &s_fs_list_driver, &s_fs_stat_driver, &s_fs_exists_driver,
        &s_fs_read_text_driver, &s_fs_write_text_driver,
        &s_fs_append_text_driver, &s_fs_remove_driver,
        &s_fs_rename_driver, &s_fs_mkdir_driver,
    };
    JSGCRef global_ref;
    JSGCRef fs_ref;
    JSValue *global_obj;
    JSValue *fs_obj;
    size_t index;
    bool result = true;

    if (runtime == NULL || runtime->fs_state != NULL) {
        return false;
    }
    runtime->fs_state = heap_caps_calloc(
        1, sizeof(esp32_mquickjs_fs_runtime_t), MALLOC_CAP_8BIT);
    if (runtime->fs_state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    fs_runtime(runtime)->lock = xSemaphoreCreateMutex();
    if (fs_runtime(runtime)->lock == NULL) {
        esp32_mquickjs_deinit_fs_runtime(runtime);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    global_obj = JS_PushGCRef(ctx, &global_ref);
    fs_obj = JS_PushGCRef(ctx, &fs_ref);
    *global_obj = JS_GetGlobalObject(ctx);
    *fs_obj = JS_IsException(*global_obj)
        ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global_obj, "fs");
    result = !JS_IsException(*fs_obj);
    for (index = 0; result && index < sizeof(names) / sizeof(names[0]); ++index) {
        JSGCRef method_ref;
        JSValue *method = JS_PushGCRef(ctx, &method_ref);

        *method = JS_IsException(*fs_obj)
            ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *fs_obj, names[index]);
        result = !JS_IsException(*method) &&
                 esp32_mquickjs_future_register_driver(ctx, runtime,
                                                       *method, drivers[index]);
        JS_PopGCRef(ctx, &method_ref);
    }
    if (!result && !JS_IsException(*fs_obj)) {
        JS_ThrowInternalError(ctx, "failed to register filesystem Future drivers");
    }
    JS_PopGCRef(ctx, &fs_ref);
    JS_PopGCRef(ctx, &global_ref);
    if (!result) {
        esp32_mquickjs_deinit_fs_runtime(runtime);
    }
    return result;
}

void esp32_mquickjs_deinit_fs_runtime(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_fs_runtime_t *state = fs_runtime(runtime);

    if (state == NULL) {
        return;
    }
    if (state->lock != NULL) {
        vSemaphoreDelete(state->lock);
    }
    heap_caps_free(state);
    runtime->fs_state = NULL;
}

static JSValue fs_future_call_and_wait(JSContext *ctx,
                                       JSValue receiver,
                                       const char *method_name,
                                       int argc,
                                       JSValue *argv)
{
    JSGCRef receiver_ref;
    JSGCRef method_ref;
    JSValue *rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *rooted_receiver = receiver;
    *method = JS_GetPropertyStr(ctx, *rooted_receiver, method_name);
    result = JS_IsException(*method)
        ? JS_EXCEPTION
        : esp32_mquickjs_future_call_and_wait(ctx,
                                              esp32_mquickjs_get_active_runtime(),
                                              *method,
                                              *rooted_receiver,
                                              argc,
                                              argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

#define FS_DIRECT_WRAPPER(function_name, method_name) \
    JSValue function_name(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv) \
    { \
        return fs_future_call_and_wait(ctx, *this_val, method_name, argc, argv); \
    }

FS_DIRECT_WRAPPER(js_fs_list, "list")
FS_DIRECT_WRAPPER(js_fs_open, "open")
FS_DIRECT_WRAPPER(js_fs_stat, "stat")
FS_DIRECT_WRAPPER(js_fs_exists, "exists")
FS_DIRECT_WRAPPER(js_fs_readText, "readText")
FS_DIRECT_WRAPPER(js_fs_writeText, "writeText")
FS_DIRECT_WRAPPER(js_fs_appendText, "appendText")
FS_DIRECT_WRAPPER(js_fs_remove, "remove")
FS_DIRECT_WRAPPER(js_fs_rename, "rename")
FS_DIRECT_WRAPPER(js_fs_mkdir, "mkdir")

#undef FS_DIRECT_WRAPPER

#endif
